In [1]:
import pandas as pd
import numpy as np

# read CSV Profesi.csv

In [2]:
df = pd.read_csv('profesi.csv', delimiter='|')
df.head()
df.tail()

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### 2.1 Ada berapa jenis profesi yang ada dalam dataset tersebut? Sebutkan!

In [3]:
nProfesi = df.occupation.nunique()
nProfesi
print(f"ada {nProfesi} jenis profesi dalam dataset")

ada 21 jenis profesi dalam dataset

In [4]:
macamProfesi = list(df.occupation.unique())
macamProfesi
print(f"Daftar profesinya adalah : {macamProfesi}")

Daftar profesinya adalah : ['technician', 'other', 'writer', 'executive', 'administrator', 'student', 'lawyer', 'educator', 'scientist', 'entertainment', 'programmer', 'librarian', 'homemaker', 'artist', 'engineer', 'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor']

### 2.2. Buatlah sebuah dataframe yang menunjukkan data usia maksimal, minimal & rata-ratanya, berdasarkan profesi & gender!

### Memisahkan data Female dan Male

In [6]:
dfMale = df[df['gender']=='M']
print("jumlah gender MALE",len(dfMale))

jumlah gender MALE 670

In [7]:
dfFemale = df[df.gender == 'F']
print("jumlah gender FEMALE",len(dfFemale))

jumlah gender FEMALE 273

In [113]:
maxMale = dfMale.groupby('occupation').describe().age['max']
minMale = dfMale.groupby('occupation').describe().age['min']
rerataMale = dfMale.groupby('occupation').describe().age['mean']

maxFemale = dfFemale.groupby('occupation').describe().age['max']
minFemale = dfFemale.groupby('occupation').describe().age['min']
rerataFemale = dfMale.groupby('occupation').describe().age['mean']

dfsorted =  df.sort_values('occupation')
pekerjaan = dfsorted['occupation'].unique()

dfView = pd.DataFrame({
        'maxMale' : maxMale,
        'minMale' : minMale,
        'maxFemale' : maxFemale,
        'minFemale' : minFemale,
        'rerataMale' : rerataMale,
        'rerataFemale' : rerataFemale
})
dfView.fillna(0)

,maxMale,minMale,maxFemale,minFemale,rerataMale,rerataFemale
administrator,70.0,21.0,62.0,22.0,37.162791,37.162791
artist,45.0,20.0,48.0,19.0,32.333333,32.333333
doctor,64.0,28.0,0.0,0.0,43.571429,43.571429
educator,63.0,25.0,51.0,23.0,43.101449,43.101449
engineer,70.0,22.0,36.0,23.0,36.600000,36.600000
entertainment,50.0,15.0,38.0,24.0,29.000000,29.000000
executive,69.0,22.0,49.0,39.0,38.172414,38.172414
healthcare,62.0,28.0,53.0,22.0,45.400000,45.400000
homemaker,23.0,23.0,50.0,20.0,23.000000,23.000000
lawyer,53.0,21.0,51.0,28.0,36.200000,36.200000
librarian,69.0,23.0,59.0,26.0,40.000000,40.000000
marketing,55.0,24.0,50.0,24.0,37.875000,37.875000
none,33.0,11.0,55.0,26.0,18.600000,18.600000
other,64.0,13.0,55.0,18.0,34.028986,34.028986
programmer,63.0,20.0,38.0,26.0,33.216667,33.216667
retired,73.0,51.0,70.0,70.0,62.538462,62.538462
salesman,66.0,21.0,33.0,18.0,38.555556,38.555556
scientist,55.0,23.0,31.0,26.0,36.321429,36.321429
student,42.0,7.0,38.0,13.0,22.669118,22.669118
technician,55.0,21.0,38.0,38.0,32.961538,32.961538
writer,60.0,21.0,56.0,18.0,35.346154,35.346154

### hitung data pergender berdasarkan PEKERJAAN

In [75]:
df1 = dfMale.groupby("occupation").count()['gender']
# print(df1)
df2 = dfFemale.groupby("occupation").count()['gender']
# print(df2)

In [30]:
dfJawab = pd.DataFrame(df1)
dfJawab = dfJawab.rename(columns={"gender": "n male"})
dfJawab

               n male
occupation
administrator      43
artist             15
doctor              7
educator           69
engineer           65
entertainment      16
executive          29
healthcare          5
homemaker           1
lawyer             10
librarian          22
marketing          16
none                5
other              69
programmer         60
retired            13
salesman            9
scientist          28
student           136
technician         26
writer             26

In [47]:
dfJawab2 = pd.DataFrame(df2)
dfJawab2 = dfJawab2.rename(columns={"gender": "n female"})
# dfJawab2

dfJawab['n female'] = dfJawab2['n female']
dfJawab = dfJawab.fillna(0)

dfJawab['total'] = dfJawab['n male'] + dfJawab['n female']
dfJawab

               n male  n female  total
occupation
administrator      43      36.0   79.0
artist             15      13.0   28.0
doctor              7       0.0    7.0
educator           69      26.0   95.0
engineer           65       2.0   67.0
entertainment      16       2.0   18.0
executive          29       3.0   32.0
healthcare          5      11.0   16.0
homemaker           1       6.0    7.0
lawyer             10       2.0   12.0
librarian          22      29.0   51.0
marketing          16      10.0   26.0
none                5       4.0    9.0
other              69      36.0  105.0
programmer         60       6.0   66.0
retired            13       1.0   14.0
salesman            9       3.0   12.0
scientist          28       3.0   31.0
student           136      60.0  196.0
technician         26       1.0   27.0
writer             26      19.0   45.0

### 2.3 Buatlah sebuah dataframe yang menunjukkan persentase pria & wanita tiap profesi!

In [54]:
dfPersen = pd.DataFrame()

dfPersen['%male'] = dfJawab.iloc[:,0] / dfJawab.iloc[:,2] * 100
dfPersen['%female'] = dfJawab.iloc[:,1] / dfJawab.iloc[:,2] * 100
dfPersen['%total'] = dfJawab.iloc[:,2] / dfJawab.iloc[:,2] * 100

dfPersen

                    %male    %female  %total
occupation
administrator   54.430380  45.569620   100.0
artist          53.571429  46.428571   100.0
doctor         100.000000   0.000000   100.0
educator        72.631579  27.368421   100.0
engineer        97.014925   2.985075   100.0
entertainment   88.888889  11.111111   100.0
executive       90.625000   9.375000   100.0
healthcare      31.250000  68.750000   100.0
homemaker       14.285714  85.714286   100.0
lawyer          83.333333  16.666667   100.0
librarian       43.137255  56.862745   100.0
marketing       61.538462  38.461538   100.0
none            55.555556  44.444444   100.0
other           65.714286  34.285714   100.0
programmer      90.909091   9.090909   100.0
retired         92.857143   7.142857   100.0
salesman        75.000000  25.000000   100.0
scientist       90.322581   9.677419   100.0
student         69.387755  30.612245   100.0
technician      96.296296   3.703704   100.0
writer          57.777778  42.222222   100.0